import { Box, ListItem, UnorderedList } from "@chakra-ui/react";

export const Contract = () => {
    return (<Box as='section'>
        <UnorderedList>
            <ListItem>Це правові відносини, які виникають із домовленостей між двома або більше сторонами, які обіцяють зробити або не зробити щось в обмін на щось цінне.</ListItem>
            <ListItem>Договірні відносини можуть включати різні види договорів, такі як договори купівлі-продажу, договори про надання послуг, трудові договори, ліцензійні договори, податкові контракти тощо.</ListItem>
            <ListItem>Юрист може допомогти у справах про договірні відносини, надаючи юридичні послуги, такі як складання, перегляд, виконання, управління та забезпечення виконання контрактів для своїх клієнтів.</ListItem>
            <ListItem>Юрист може допомогти своїм клієнтам зрозуміти прямі та непрямі умови контракту; дотримуватися застосовних законів і правил; захищати свої права та інтереси; уникати або вирішувати суперечки; і вимагати засобів правового захисту за порушення контракту.</ListItem>
        </UnorderedList>
    </Box>)
}