export const qoutes = [
    'Якщо суддя не знає як вирішити справу, він вирішує її за законом.',
    'Справжні закони покояться в людській природі; хто діє всупереч їм, той відчуває на собі наслідки цього. - А. Ейнзідель',
    'Почерк обвинуваченого? - Запитав інший присяжний. - Ні, - відповів Білий Кролик. - І це підозріліше всього. (Присяжні розгубилися) - Виходить, підробив почерк, - зауважив Король. (Присяжні просвітліли) - Льюїс Керрол',
    'Закони схожі на павутину: слабкого вони заплутують, а сильний їх прорве. - Солон',
    'Незнання закону не звільняє від відповідальності. А от знання нерідко звільняє. - Станіслав Їжака Лец',
]