/** @format */

export const servList = [
  {
    name: "Сімейні спори",
    img: "/family.jpg",
    description: "Сімейні спори",
  },
  {
    name: "Спадкові спори",
    description:
      "Пропущення строку для прийняття спадщини, усунення від права на спадкування, визнання права власності в порядку спадкування, отримання права на обов'язкову частку в спадщині, тлумачення заповіту, встановлення факту прийняття спадщини, черговість спадкування за законом, визнання спадщини від умерлого.",
    img: "/spadok.jpg",
  },
  {
    name: "Житлові спори",
    description:
      "Захист прав на володіння, розпорядження і користування житлом фізичних осіб і організацій",
    img: "/house.webp",
  },
  {
    name: "Земельні спори",
    description:
      "Порушення права власності і користування земельною ділянкою між користувачами і землевласником",
    img: "/soil.webp",
  },
  {
    name: "Договірні правовідносини",
    description:
      "Вирішення питань порушення, а також роз’яснення по умовам догорів в т.ч. дарування, ренти, оренди, комерційної діяльності, підряду найму, позички, спільної діяльності, науково-дослідних і дослідно-конструкторських робіт, надання послуг, експедитування, перевезення,  зберігання,  доручення,страхування, комісії, управління майном, розпоряджання майновими правами інтелектуальної власності.",
    img: "/Dogovir14.webp",
  },
  {
    name: "Справи про адміністративні правопорушення",
    description: "Справи про адміністративні правопорушення",
    img: "/admin.webp",
  },
  {
    name: "Представництво інтересів потерпілих у кримінальному провадженні",
    description:
      "Представництво інтересів потерпілих у кримінальному провадженні",
    img: "/criminal.webp",
  },
];
