

export const servList = [
    {
        name: 'Сімейні спори',
        img: 'https://live.staticflickr.com/65535/52693028779_d402f03bf1_q.jpg',
        description: 'Сімейні спори',
    },
    {
        name: 'Спадкові спори',
        description: "Пропущення строку для прийняття спадщини, усунення від права на спадкування, визнання права власності в порядку спадкування, отримання права на обов'язкову частку в спадщині, тлумачення заповіту, встановлення факту прийняття спадщини, черговість спадкування за законом, визнання спадщини від умерлого.",
        img: 'https://live.staticflickr.com/65535/52693252208_2a6db72d31_q.jpg'
    },
    {
        name: 'Житлові спори',
        description: 'Захист прав на володіння, розпорядження і користування житлом фізичних осіб і організацій',
        img: 'https://live.staticflickr.com/65535/52692790981_66570d08dc_q.jpg'
    },
    {
        name: 'Земельні спори',
        description: "Порушення права власності і користування земельною ділянкою між користувачами і землевласником",
        img: 'https://live.staticflickr.com/65535/52693275638_b9f56cccaf_q.jpg'
    },
    {
        name: 'Договірні правовідносини',
        description: "Вирішення питань порушення, а також роз’яснення по умовам догорів в т.ч. дарування, ренти, оренди, комерційної діяльності, підряду найму, позички, спільної діяльності, науково-дослідних і дослідно-конструкторських робіт, надання послуг, експедитування, перевезення,  зберігання,  доручення,страхування, комісії, управління майном, розпоряджання майновими правами інтелектуальної власності.",
        img: 'https://live.staticflickr.com/65535/52693028754_8487097e23_q.jpg'
    },
    {
        name: 'Справи про адміністративні правопорушення',
        description: "Корупційні правопорушення, порушення права на інформацію.",
        img: 'https://live.staticflickr.com/65535/52693191910_135747dcbf_q.jpg'
    },
    {
        name: 'Представництво інтересів потерпілих у кримінальному провадженні',
        description: "Оскарження рішень суду, визнання потерпілим, захист прав потерпілого.",
        img: 'https://live.staticflickr.com/65535/52693252318_f1cec595b9_q.jpg'
    },
]